           01 JUD-COD.
               05                  PIC X(32) VALUE
                                   "01ALBA                          ".
               05                  PIC X(32) VALUE
                                   "02ARAD                          ".
               05                  PIC X(32) VALUE
                                   "04BACAU                         ".
               05                  PIC X(32) VALUE
                                   "05BIHOR                         ".
               05                  PIC X(32) VALUE
                                   "06BISTRITA-NASAUD               ".
               05                  PIC X(32) VALUE
                                   "07BOTOSAN                       ".
               05                  PIC X(32) VALUE
                                   "08BRASOV                        ".
               05                  PIC X(32) VALUE
                                   "09BRAILA                        ".
               05                  PIC X(32) VALUE
                                   "10BUZAU                         ".
               05                  PIC X(32) VALUE
                                   "11CARAS-SEVERIN                 ".
               05                  PIC X(32) VALUE
                                   "12CLUJ                          ".
               05                  PIC X(32) VALUE
                                   "13CONSTANTA                     ".
               05                  PIC X(32) VALUE
                                   "14COVASNA                       ".
               05                  PIC X(32) VALUE
                                   "15DOLJ                          ".
               05                  PIC X(32) VALUE
                                   "16GALATI                        ".
               05                  PIC X(32) VALUE
                                   "10BUZAU                         ".
               05                  PIC X(32) VALUE
                                   "11CARAS-SEVERIN                 ".
               05                  PIC X(32) VALUE
                                   "12CLUJ                          ".
               05                  PIC X(32) VALUE
                                   "13CONSTANTA                     ".
               05                  PIC X(32) VALUE
                                   "14COVASNA                       ".
               05                  PIC X(32) VALUE
                                   "15DAMBOVITA                     ".
               05                  PIC X(32) VALUE
                                   "16DOLJ                          ".
               05                  PIC X(32) VALUE
                                   "17GALATI                        ".
               05                  PIC X(32) VALUE
                                   "18GORJ                          ".
               05                  PIC X(32) VALUE
                                   "19HARGHITA                      ".
               05                  PIC X(32) VALUE
                                   "20HUNEDOARA                     ".
               05                  PIC X(32) VALUE
                                   "21IALOMITA                      ".
               05                  PIC X(32) VALUE
                                   "22IASI                          ".
               05                  PIC X(32) VALUE
                                   "23ILFOV                         ".
               05                  PIC X(32) VALUE
                                   "24MARAMURES                     ".
               05                  PIC X(32) VALUE
                                   "25MEHEDINTI                     ".
               05                  PIC X(32) VALUE
                                   "26MURES....                     ".
               05                  PIC X(32) VALUE
                                   "27NEAMT                         ".
               05                  PIC X(32) VALUE
                                   "28OLT                           ".
               05                  PIC X(32) VALUE
                                   "29PRAHOVA                       ".
               05                  PIC X(32) VALUE
                                   "30SATU-MARE                     ".
               05                  PIC X(32) VALUE
                                   "31SALAJ                         ".
               05                  PIC X(32) VALUE
                                   "32SIBIU                         ".
               05                  PIC X(32) VALUE
                                   "33SUCEAVA                       ".
               05                  PIC X(32) VALUE
                                   "34TELEORMAN                     ".
               05                  PIC X(32) VALUE
                                   "35TIMIS                         ".
               05                  PIC X(32) VALUE
                                   "36TULCEA                        ".
               05                  PIC X(32) VALUE
                                   "37VASLUI                        ".
               05                  PIC X(32) VALUE
                                   "38VALCEA                        ".
               05                  PIC X(32) VALUE
                                   "39VRANCEA                       ".
               05                  PIC X(32) VALUE
                                   "40BUCURESTI                     ".
               05                  PIC X(32) VALUE
                                   "41BUCURESTI S.1                 ".
               05                  PIC X(32) VALUE
                                   "42BUCURESTI S.2                 ".
               05                  PIC X(32) VALUE
                                   "43BUCURESTI S.3                 ".
               05                  PIC X(32) VALUE
                                   "44BUCURESTI S.4                 ".
               05                  PIC X(32) VALUE
                                   "45BUCURESTI S.5                 ".
               05                  PIC X(32) VALUE
                                   "46BUCURESTI S.6                 ".
               05                  PIC X(32) VALUE
                                   "51CALARASI                      ".
               05                  PIC X(32) VALUE
                                   "52GIURGIU                       ".
