           01 NOTE-INFO.
               05 NOTE-CNP-STUD PIC X(13).
               05 NOTE-MATERIE  PIC X(30).
               05 NOTE-NOTA     PIC X(2).
               05 NOTE-DATA     PIC X(08).
               05 NOTE-CLASA     PIC X(04).
               05 NOTE-ERROR     PIC 9(01).
