           01 PROFI-MATERII-INFO.
               05 MAT-CLASA             PIC X(04).
               05 MAT-NUME              PIC X(30).
               05 PROF-NUME              PIC X(30).
               05 PROF-PRENUME           PIC X(30).
               05 PROF-CNP               PIC X(13).
               05 PROF-ERROR             PIC 9(01).
               05 PROF-DATA-NASTERE      PIC 9(08).
               05 PROF-SEX               PIC X(01).
